export const qus = {
  testDatas: [
    {
      qusNum: 'Q1',
      qa: '「人生是什麼」這個問題，我能否以一個確切的答案來回答？',
      ans: [
        {
          a1: 'A. 這是不可能的事',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是要先念幾年書再回答',
          score: 3,
        },
        {
          a1: 'C. 可以，但是要給我一天時間，用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 當然可以，而且我知道怎麼用十個字說清楚',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q2',
      qa: '「施比受更有福」這說法是對的',
      ans: [
        {
          id: 's1',
          a1: 'A. 當然是對的',
          score: 1,
        },
        {
          id: 's2',
          a1: 'B. 我知道有可能是對的，但是說不清主道理，要先念幾年書再回答',
          score: 3,
        },
        {
          id: 's3',
          a1: 'C. 可能是對的，也有可能是錯的，但是要給我一天時間，用兩千字來申論',
          score: 6,
        },
        {
          id: 's4',
          a1: 'D. 我知道如何證明「施比受更有福」可以是錯的',
          score: 9,
        },
        {
          id: 's5',
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q3',
      qa: '「自由」就是「沒有限制」，如果有「限制」，就不是自由',
      ans: [
        {
          a1: 'A. 完全同意',
          score: 1,
        },
        {
          a1: 'B. 同意但說不出為什麼，要先念幾年書再回答',
          score: 3,
        },
        {
          a1: 'C. 同意，而且我也可以說清楚，但要給我一天時間，用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 不同意，而且我可以證明「限制可以讓我們更自由」',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q4',
      qa: '我們對現實的認識，是否受到科學知識的侷限？',
      ans: [
        {
          a1: 'A. 會啊！現實是可以用感受的，跟科學知識無關',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是說不清楚，要先念幾年書才能表達',
          score: 3,
        },
        {
          a1: 'C. 當然是，而且我可以想到至少五個例子',
          score: 6,
        },
        {
          a1: 'D. 當然不是，而且我可以找到證據證明',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q5',
      qa: '藝術作品是否與其他日常生活一樣現實？',
      ans: [
        {
          a1: 'A. 藝術當然不是現實',
          score: 1,
        },
        {
          a1: 'B. 藝術有可能是現實，但是我不會解釋，還要多念點書',
          score: 3,
        },
        {
          a1: 'C. 我知道藝術可以是現實，但是要給我一天時間， 用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 藝術當然就是現實，而且我可以想到至少五個例子來舉證',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q6',
      qa: '人們能否擺脫偏見？',
      ans: [
        {
          a1: 'A. 只要會思考當然就可以',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是要看什麼樣的偏見',
          score: 3,
        },
        {
          a1: 'C. 可以，但是需要很多的公民教育',
          score: 6,
        },
        {
          a1: 'D.當然可以，而且我都知道怎麼對抗每一個我所知道的偏見',
          score: 9,
        },
        {
          a1: 'E. 這是不可能的事',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q7',
      qa: '人們是否可以有慾望而不痛苦？',
      ans: [
        {
          a1: 'A. 這是不可能的事',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是要念很多書的人行',
          score: 3,
        },
        {
          a1: 'C. 我知道可以，我有實例，但是我說不出道理',
          score: 6,
        },
        {
          a1: 'D. 當然可以，而且我可以舉例說明有慾望而不痛苦，也能說明道理',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q8',
      qa: '歷史的客觀性是否須以歷史學者的公正為條件？',
      ans: [
        {
          a1: 'A. 當然，所有歷史學者要有道德觀',
          score: 1,
        },
        {
          a1: 'B. 有可能，所有歷史學家必須要提出歷史證據',
          score: 3,
        },
        {
          a1: 'C. 需要，因為歷史學者就算不公正，讀者還是可以看得出真相',
          score: 6,
        },
        {
          a1: 'D. 不需要，因為就算歷史學者公正，也根本不可能有客觀的歷史',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q9',
      qa: '人們能否不要國家？',
      ans: [
        {
          a1: 'A. 當然不行。這還需要問嗎?',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是我說不出原因',
          score: 3,
        },
        {
          a1: 'C. 可以，但是要給我一天時間，用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 當然可以，而且我知道為什麼人們可以不需要國家',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q10',
      qa: '給予自己未來，是否應當忘記過去？',
      ans: [
        {
          a1: 'A. 忘記過去？這是不可能的事',
          score: 1,
        },
        {
          a1: 'B. 忘記過去跟給予未來是不相干的事',
          score: 3,
        },
        {
          a1: 'C. 我知道這是對的，但是要給我一天時間，用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 我知道為什麼人就算忘記過去，也不能夠給予自完全要看狀況',
          score: 9,
        },
        {
          a1: 'E. 完全要看狀況',
          score: 0,
        },
      ],
    },
    {
      qusNum: 'Q11',
      qa: '我們活著是為了快樂嗎？',
      ans: [
        {
          a1: 'A. 這是不可能的事，因為「生即是苦」',
          score: 1,
        },
        {
          a1: 'B. 有可能，但是我無法解釋，要先念幾年書再回答',
          score: 3,
        },
        {
          a1: 'C. 我知道這是對的，但是要給我一天時間，用兩千字來回答',
          score: 6,
        },
        {
          a1: 'D. 當然是，而且我知道怎麼用十個字說清楚快樂的本質',
          score: 9,
        },
        {
          a1: 'E. 有錢就快樂，沒錢就不快樂',
          score: 0,
        },
      ],
    },
  ],
};
